Tekla Open API Reference for Tekla Structures 2025
ModuleManager.AnalysisAndDesign Property
 Indicates whether the Analysis and Design management is enabled.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool AnalysisAndDesign { get; }
Public Shared ReadOnly Property AnalysisAndDesign As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModuleManager Class
Tekla.Structures Namespace